Rewbert/stm32-nucleo/main-drivers/main.c
#include "stm32l5xx.h" // only need this for the m33-specific SysTick_Config (for now)
#include "domain/domain.h"
#include "domain/cmsis_select.h"

#include "boards/board.h"

#include "drivers/gpio.h"
#include "drivers/uart.h"
#include "drivers/exti.h"
#include "drivers/rcc.h"
#include "drivers/pwr.h"
#include "drivers/systick.h"
#include "drivers/irq.h"

static void sys_init(void) {
    board_init();

    rcc_configure_pll(board_rcc(), board_flash(), 55, 1, 7, 110000000); // 110 MHz on my stm32l5

    rcc_enable(board_rcc(), RCC_GPIOA);
    rcc_enable(board_rcc(), RCC_GPIOB);
    rcc_enable(board_rcc(), RCC_GPIOC);

    uart_config_t uart_cfg = {
        .baudrate    = 115200,
        .word_length = 8,
        .stop_bits   = 1,
        .parity      = UART_PARITY_NONE,
    };
    uart_init(board_console(), &uart_cfg);
    
    SysTick_Config(110000);
    irq_enable();
}

static void button_callback(exti_edge_t edge) {
    (void)edge;
    const char msg[] = "hello from the button callback!\r\n";
    uart_write(board_console(), (const uint8_t *)msg, sizeof(msg) - 1);
}

/**
 * @brief This function initialises a button the a breadboard. The button is connected from
 * pin on board -> capacitor -> button -> capacitor -> gnd on board (if that makes any sense).
 *
 * We need to 1) configure the gpio and 2) configure the EXTI peripheral 
 */
static void inline breadboard_button_init() {
    /*** Configure the GPIO pin ***/
    board_gpio_backend_t bb_button_backend;
    gpio_dev_t bb_button;
    board_gpio_create(&bb_button, BOARD_GPIO_PORT_A, 2, &bb_button_backend);

    gpio_config_t bb_button_cfg = {
        .mode            = GPIO_MODE_INPUT,
        .pull            = GPIO_PULLUP,
        .alternate       = GPIO_AF0,
        .security_domain = GPIO_SECURE,
    };
    gpio_init(&bb_button, &bb_button_cfg);

    /*** Configure the EXTI line ***/
    board_exti_backend_t bb_exti_backend;
    exti_dev_t bb_exti;
    board_exti_create(&bb_exti, &bb_exti_backend);

    exti_config_t bb_exti_cfg = {
        .port             = EXTI_PORT_A,
        .pin              = 2,
        .edge             = EXTI_EDGE_FALLING,
        .priority         = 0,
        .secure           = true,
        .target_nonsecure = false,
    };
    exti_init(&bb_exti, &bb_exti_cfg);
    exti_register_callback(&bb_exti, button_callback);
}

void main(void) {
    sys_init();

    gpio_config_t led_cfg = {
        .mode      = GPIO_MODE_OUTPUT,
        .pull      = GPIO_NOPULL,
        .alternate = GPIO_AF0,
    };
    gpio_init(board_led(BOARD_LED_RED),   &led_cfg);
    gpio_init(board_led(BOARD_LED_BLUE),  &led_cfg);
    gpio_init(board_led(BOARD_LED_GREEN), &led_cfg);

    board_button_init(board_button(BOARD_BUTTON_USER), GPIO_SECURE, EXTI_EDGE_FALLING, button_callback);
    breadboard_button_init();

    while (1) {
        gpio_toggle(board_led(BOARD_LED_RED));
        gpio_toggle(board_led(BOARD_LED_BLUE));
        gpio_toggle(board_led(BOARD_LED_GREEN));

        const char msg[] = "hello world!\r\n";
        uart_write(board_console(), (const uint8_t *)msg, sizeof(msg) - 1);

        systick_delay_ms(500);
    }
}

NONSECURE_CALLABLE int add(int x) {
    return x+1;
}